package com.terry.daxiang.jiazhang.json;

/**
 * Created by Administrator on 2016/9/16.
 */
public class JSON {
    public static String banjiquan = "{\n" +
            "  \"data\":[\n" +
            "    {\"icon\":\"\",\"name\":\"刘老师\",\"time\":\"2016.06.14\",\"fenlei\":\"精彩瞬间\",\"text\":\"今天宝宝表现很好,和同学做活动很嗨.\",\"type\":\"img\",\"url\":[\"\",\"\",\"\"]},\n" +
            "{\"icon\":\"\",\"name\":\"王老师\",\"time\":\"2016.06.14\",\"fenlei\":\"园所安全\",\"text\":\"今天宝宝表现很好,和同学做活动很嗨.\",\"type\":\"img\",\"url\":[\"\",\"\",\"\"]},\n" +
            "{\"icon\":\"\",\"name\":\"刘老师\",\"time\":\"2016.06.14\",\"fenlei\":\"课程计划\",\"text\":\"\",\"type\":\"img\",\"url\":[\"\"]}\n" +
            "]\n" +
            "}";
    public static String jingcaishunjian = "{\n" +
            "  \"data\":[\n" +
            "    {\"icon\":\"\",\"name\":\"刘老师\",\"time\":\"2016.06.14\",\"fenlei\":\"精彩瞬间\",\"text\":\"今天宝宝表现很好,和同学做活动很嗨.\",\"type\":\"img\",\"url\":[\"\",\"\",\"\"]},\n" +
            "{\"icon\":\"\",\"name\":\"王老师\",\"time\":\"2016.06.14\",\"fenlei\":\"精彩瞬间\",\"text\":\"今天宝宝表现很好,和同学做活动很嗨.\",\"type\":\"img\",\"url\":[\"\",\"\",\"\"]},\n" +
            "{\"icon\":\"\",\"name\":\"刘老师\",\"time\":\"2016.06.14\",\"fenlei\":\"精彩瞬间\",\"text\":\"今天宝宝表现很好,和同学做活动很嗨.\",\"type\":\"img\",\"url\":[\"\",\"\",\"\"]},\n" +
            "{\"icon\":\"\",\"name\":\"王老师\",\"time\":\"2016.06.14\",\"fenlei\":\"精彩瞬间\",\"text\":\"今天宝宝表现很好,和同学做活动很嗨.\",\"type\":\"img\",\"url\":[\"\",\"\",\"\"]}\n" +
            "]\n" +
            "}";
    public static String tongzhitonggao = "{\n" +
            "  \"data\":[\n" +
            "    {\"icon\":\"\",\"name\":\"刘老师\",\"time\":\"2016.06.14\",\"fenlei\":\"通知通告\",\"text\":\"今天宝宝表现很好,和同学做活动很嗨.\",\"type\":\"img\",\"url\":[\"\",\"\",\"\"]},\n" +
            "{\"icon\":\"\",\"name\":\"王老师\",\"time\":\"2016.06.14\",\"fenlei\":\"通知通告\",\"text\":\"今天宝宝表现很好,和同学做活动很嗨.\",\"type\":\"img\",\"url\":[\"\",\"\",\"\"]},\n" +
            "{\"icon\":\"\",\"name\":\"王老师\",\"time\":\"2016.06.14\",\"fenlei\":\"通知通告\",\"text\":\"今天宝宝表现很好,和同学做活动很嗨.\",\"type\":\"img\",\"url\":[\"\",\"\",\"\"]},\n" +
            "{\"icon\":\"\",\"name\":\"王老师\",\"time\":\"2016.06.14\",\"fenlei\":\"通知通告\",\"text\":\"今天宝宝表现很好,和同学做活动很嗨.\",\"type\":\"img\",\"url\":[\"\",\"\",\"\"]}\n" +
            "]\n" +
            "}";
    public static String tongxunlu = "{\n" +
            "  \"data\":[\n" +
            "    {\"icon\":\"\",\"name\":\"刘老师\",\"zhiwei\":\"主班\",\"phone\":\"123456789\"},\n" +
            "    {\"icon\":\"\",\"name\":\"王老师\",\"zhiwei\":\"副班\",\"phone\":\"123456789\"},\n" +
            "    {\"icon\":\"\",\"name\":\"王老师\",\"zhiwei\":\"副班\",\"phone\":\"123456789\"}\n" +
            "]\n" +
            "}";
    public static String pinglun = "{\n" +
            "  \"zan\":[{\"user\":\"user\"},{\"user\":\"user\"}],\n" +
            "  \"pinglun\":[\n" +
            "    {\"name\":\"刘小明(爸)\",\"text\":\"视频不错,老师辛苦了\"},\n" +
            "    {\"name\":\"刘艳(妈)\",\"text\":\"视频不错\"},\n" +
            "    {\"name\":\"刘小明(爸)\",\"text\":\"视频不错,老师辛苦了\"},\n" +
            "    {\"name\":\"刘艳(妈)\",\"text\":\"视频不错\"},\n" +
            "    {\"name\":\"刘小明(爸)\",\"text\":\"视频不错,老师辛苦了\"}\n" +
            "]\n" +
            "}";
    public static String chengzhangrizhi = "{\n" +
            "  \"data\":[\n" +
            "    {\"name\":\"刘老师\",\"time\":\"2016.06.14\",\"type\":\"img\",\"text\":\"宝宝今天表现不错,和其他小朋友做活动玩得很嗨\",\"url\":[\"\",\"\",\"\"]},\n" +
            "{\"name\":\"刘老师\",\"time\":\"2016.06.14\",\"type\":\"img\",\"text\":\"宝宝今天表现不错,和其他小朋友做活动玩得很嗨\",\"url\":[\"\",\"\",\"\"]},\n" +
            "{\"name\":\"刘老师\",\"time\":\"2016.06.14\",\"type\":\"img\",\"text\":\"宝宝今天表现不错,和其他小朋友做活动玩得很嗨\",\"url\":[\"\",\"\",\"\"]}\n" +
            "]\n" +
            "}";
    public static String daxiangfm = "{\n" +
            "  \"data\": [\n" +
            "    {\n" +
            "      \"icon\": \"\",\n" +
            "      \"name\": \"刘老师\",\n" +
            "      \"time\": \"2016.06.14\",\n" +
            "      \"type\": \"shipin\",\n" +
            "      \"count\": \"2998\",\n" +
            "      \"text\": \"西游记视频故事\",\n" +
            "      \"url\": \"\",\n" +
            "      \"zan\": [\n" +
            "        {\n" +
            "          \"user\": \"\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"user\": \"\"\n" +
            "        }\n" +
            "      ],\n" +
            "      \"pinglun\": [\n" +
            "        {\n" +
            "          \"user\": \"\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"user\": \"\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"user\": \"\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"user\": \"\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"user\": \"\"\n" +
            "        }\n" +
            "      ]\n" +
            "    },\n" +
            "    {\n" +
            "      \"icon\": \"\",\n" +
            "      \"name\": \"王老师\",\n" +
            "      \"time\": \"2016.06.14\",\n" +
            "      \"type\": \"yinpin\",\n" +
            "      \"count\": \"998\",\n" +
            "      \"text\": \"三国演义精彩片段\",\n" +
            "      \"url\": \"\",\n" +
            "      \"zan\": [\n" +
            "        {\n" +
            "          \"user\": \"\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"user\": \"\"\n" +
            "        }\n" +
            "      ],\n" +
            "      \"pinglun\": [\n" +
            "        {\n" +
            "          \"user\": \"\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"user\": \"\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"user\": \"\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"user\": \"\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"user\": \"\"\n" +
            "        }\n" +
            "      ]\n" +
            "    },\n" +
            "    {\n" +
            "      \"icon\": \"\",\n" +
            "      \"name\": \"刘老师\",\n" +
            "      \"time\": \"2016.06.14\",\n" +
            "      \"type\": \"shipin\",\n" +
            "      \"count\": \"1998\",\n" +
            "      \"text\": \"西游记视频故事\",\n" +
            "      \"url\": \"\",\n" +
            "      \"zan\": [\n" +
            "        {\n" +
            "          \"user\": \"\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"user\": \"\"\n" +
            "        }\n" +
            "      ],\n" +
            "      \"pinglun\": [\n" +
            "        {\n" +
            "          \"user\": \"\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"user\": \"\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"user\": \"\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"user\": \"\"\n" +
            "        },\n" +
            "        {\n" +
            "          \"user\": \"\"\n" +
            "        }\n" +
            "      ]\n" +
            "    }\n" +
            "  ]\n" +
            "}";
    public static String rementuijian = "{\n" +
            " \"data\":[\n" +
            "   {\"name\":\"奇智奇材\",\"icon\":\"\",\"url\":\"\"},\n" +
            "{\"name\":\"唐诗\",\"icon\":\"\",\"url\":\"\"},\n" +
            "{\"name\":\"咕咚\",\"icon\":\"\",\"url\":\"\"},\n" +
            "{\"name\":\"我是一只爱写作的铅笔\",\"icon\":\"\",\"url\":\"\"},\n" +
            "{\"name\":\"唐诗\",\"icon\":\"\",\"url\":\"\"},\n" +
            "{\"name\":\"咕咚\",\"icon\":\"\",\"url\":\"\"},\n" +
            "{\"name\":\"奇智奇材\",\"icon\":\"\",\"url\":\"\"}\n" +
            "]\n" +
            "}";
    public static String zhuanji = "{\n" +
            "  \"data\":[\n" +
            "    {\"name\":\"奇智奇材-社会(小班)\",\"text\":\"培养小朋友对社会的初步感知和交往能力\",\"count\":\"20\"},\n" +
            "{\"name\":\"奇智奇材-社会(中班)\",\"text\":\"培养小朋友对社会的初步感知和交往能力\",\"count\":\"20\"},\n" +
            "{\"name\":\"奇智奇材-社会(小班)\",\"text\":\"培养小朋友对社会的初步感知和交往能力\",\"count\":\"20\"}\n" +
            "]\n" +
            "}";
    public static String tianjiaguanzhu = "{\n" +
            "  \"data\":[\n" +
            "    {\"name\":\"奇智奇材-社会(小班)\",\"text\":\"培养小朋友对社会的初步感知和交往能力\",\"type\":\"0\"},\n" +
            "{\"name\":\"奇智奇材-社会(中班)\",\"text\":\"培养小朋友对社会的初步感知和交往能力\",\"type\":\"1\"},\n" +
            "{\"name\":\"奇智奇材-社会(小班)\",\"text\":\"培养小朋友对社会的初步感知和交往能力\",\"type\":\"0\"},\n" +
            "{\"name\":\"奇智奇材-社会(中班)\",\"text\":\"培养小朋友对社会的初步感知和交往能力\",\"type\":\"1\"}\n" +
            "]\n" +
            "}";
    public static String xingwei_zhou = "{\n" +
            "  \"data\":[\n" +
            "    {\"name\":\"2016年7月  第一周\",\"text\":\"这道题我无论怎么算也算不出来。这下我的心像是被封锁在了北极的大冰山里一样，我想放弃了：这些题是尖子生才有可能做出来的，而我，却从来都没当过尖子生，我怎么有可能做出这种难题呢。想着想着，心里还真难受，我竟趴在桌子上哭了起来。突然，我想起了爸爸对我说的诘。\\n一道亮光划过心头，“对，男儿有泪不轻弹，不可以在困难面前倒下。”想到这儿，我立刻擦干眼泪，重拾信心，准备与“敌人”血拼了。\\n我拿出学习电脑查相关题型，仔细听了讲解后，才知道，原来这道题要用分数除法。经过我不断地对比、计算，我终于把这道题解开了。我不禁为自己战胜困难欢呼了起来。\"},\n" +
            " {\"name\":\"2016年6月  第四周\",\"text\":\"这道题我无论怎么算也算不出来。这下我的心像是被封锁在了北极的大冰山里一样，我想放弃了：这些题是尖子生才有可能做出来的，而我，却从来都没当过尖子生，我怎么有可能做出这种难题呢。想着想着，心里还真难受，我竟趴在桌子上哭了起来。突然，我想起了爸爸对我说的诘。\\n一道亮光划过心头，“对，男儿有泪不轻弹，不可以在困难面前倒下。”想到这儿，我立刻擦干眼泪，重拾信心，准备与“敌人”血拼了。\\n我拿出学习电脑查相关题型，仔细听了讲解后，才知道，原来这道题要用分数除法。经过我不断地对比、计算，我终于把这道题解开了。我不禁为自己战胜困难欢呼了起来。\"}\n" +
            "]\n" +
            "}";
    public static String xingweixiangqing = "{\n" +
            "  \"data\":[\n" +
            "    {\"name\":\"培养运动习惯,训练自理能力\",\"text\":\"这道题我无论怎么算也算不出来。这下我的心像是被封锁在了北极的大冰山里一样，我想放弃了：这些题是尖子生才有可能做出来的，而我，却从来都没当过尖子生，我怎么有可能做出这种难题呢。想着想着，心里还真难受，我竟趴在桌子上哭了起来。突然，我想起了爸爸对我说的诘。\\n一道亮光划过心头，“对，男儿有泪不轻弹，不可以在困难面前倒下。”想到这儿，我立刻擦干眼泪，重拾信心，准备与“敌人”血拼了。\\n我拿出学习电脑查相关题型，仔细听了讲解后，才知道，原来这道题要用分数除法。经过我不断地对比、计算，我终于把这道题解开了。我不禁为自己战胜困难欢呼了起来。\"},\n" +
            " {\"name\":\"培养运动习惯,训练自理能力\",\"text\":\"这道题我无论怎么算也算不出来。这下我的心像是被封锁在了北极的大冰山里一样，我想放弃了：这些题是尖子生才有可能做出来的，而我，却从来都没当过尖子生，我怎么有可能做出这种难题呢。想着想着，心里还真难受，我竟趴在桌子上哭了起来。突然，我想起了爸爸对我说的诘。\\n一道亮光划过心头，“对，男儿有泪不轻弹，不可以在困难面前倒下。”想到这儿，我立刻擦干眼泪，重拾信心，准备与“敌人”血拼了。\\n我拿出学习电脑查相关题型，仔细听了讲解后，才知道，原来这道题要用分数除法。经过我不断地对比、计算，我终于把这道题解开了。我不禁为自己战胜困难欢呼了起来。\"}\n" +
            "]\n" +
            "}";
    public static String jiankong = "{\n" +
            "  \"data\":[\n" +
            "    {\"weizhi\":\"大象顺义东区园所(小一班)\",\"zhuangtai\":\"正常\",\"shijian\":\"2016年6月1日 - 2016年6月30日\"},\n" +
            "{\"weizhi\":\"大象顺义东区园所(小一班)\",\"zhuangtai\":\"正常\",\"shijian\":\"2016年6月1日 - 2016年6月30日\"},\n" +
            "{\"weizhi\":\"大象顺义东区园所(大一班)\",\"zhuangtai\":\"正常\",\"shijian\":\"2016年6月1日 - 2016年6月30日\"}\n" +
            "]\n" +
            "}";
    public static String kaoqin = "{\n" +
            "  \"data\":[\n" +
            "    {\"time\":\"2016年4月考勤\",\"chuqin\":\"27\",\"shijia\":\"2\",\"bingjia\":\"1\"},\n" +
            "{\"time\":\"2016年3月考勤\",\"chuqin\":\"28\",\"shijia\":\"2\",\"bingjia\":\"1\"}\n" +
            "]\n" +
            "}";
    public static String yongyao = "{\n" +
            "  \"data\":[\n" +
            "    {\"time\":\"2016-6-20\",\"mingcheng\":\"少儿咳喘口服液\",\"shuliang\":\"2支\",\"songyaoren\":\"1\"},\n" +
            "{\"time\":\"2016-6-20\",\"mingcheng\":\"少儿咳喘口服液\",\"shuliang\":\"2支\",\"songyaoren\":\"1\"},\n" +
            "{\"time\":\"2016-6-20\",\"mingcheng\":\"少儿咳喘口服液\",\"shuliang\":\"2支\",\"songyaoren\":\"1\"},\n" +
            "{\"time\":\"2016-6-20\",\"mingcheng\":\"少儿咳喘口服液\",\"shuliang\":\"2支\",\"songyaoren\":\"1\"},\n" +
            "{\"time\":\"2016-6-20\",\"mingcheng\":\"少儿咳喘口服液\",\"shuliang\":\"2支\",\"songyaoren\":\"1\"}\n" +
            "]\n" +
            "}";
    public static String g = "";
}